"""
     Урок 8. 6. Продолжить работу над вторым заданием. Реализуйте механизм валидации вводимых пользователем данных.
     Например, для указания количества принтеров, отправленных на склад, нельзя использовать строковый тип данных.
     Подсказка: постарайтесь реализовать в проекте «Склад оргтехники» максимум возможностей, изученных на уроках по ООП.
"""

# class MyError(Exception):
#     def __init__(self, text):
#         self.txt = text


def main():



if __name__ == '__main__':
    main()
